Tekla Open API Reference for Tekla Structures 2025
Assertion.ToString Method
 The tostring.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override string ToString()
Public Overrides Function ToString As String
Return Value
Type: String
 The String.
See Also
Reference
Assertion Class
Tekla.Structures Namespace